app/controllers/recommendations_controller.rb

  def index
    # recent_media = Instagram.tag_recent_media('fashion')
    @user = User.find(params[:user_id])
    @recommendations = Recommendation.all
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT "recommendations".* FROM "recommendations"

  def create
    @user = current_user
    @recommendation = Recommendation.new(recommendation_params.merge(user_id: @user.id))

    respond_to do |format|
      if @recommendation.save
---
INSERT INTO "recommendations" ("name", "cuisine", "city", "description", "geocode", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    @recommendation = Recommendation.find(params[:id])
    respond_to do |format|
      if @recommendation.update(recommendation_params)
---
SELECT  "recommendations".* FROM "recommendations" WHERE "recommendations"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "recommendations" SET "name" = $1, "cuisine" = $2, "location" = $3, "description" = $4, "updated_at" = $5 WHERE "recommendations"."id" = $6  [["name", "Cha Cha Cha"], ["cuisine", "Caribean"], ["location", "SF"], ["description", "Great jerky and sangria!!"], ["updated_at", 2017-01-11 03:58:02 UTC], ["id", 16]]

  def destroy
    @recommendation = Recommendation.find(params[:id])
    respond_to do |format|
      if @recommendation.user_id == current_user.id
        @recommendation.destroy
---
SELECT  "recommendations".* FROM "recommendations" WHERE "recommendations"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
DELETE FROM "recommendations" WHERE "recommendations"."id" = $1  [["id", 8]]